test/upnpparsetest.cpp

#include <string>
#include <map>
#include <gtest/gtest.h>

TEST(UpnpParseTest, parse_request) {

//    std::string request = "<?xml version=\"1.0\" encoding=\"utf-8\" standalone=\"yes\"?><s:Envelope s:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\" xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\"><s:Body><u:GetProtocolInfo xmlns:u=\"urn:schemas-upnp-org:service:ConnectionManager:1\"/></s:Body></s:Envelope>";
//    ::upnp::UpnpContentDirectoryRequest upnp_command = ::upnp::parseRequest( request );

//    EXPECT_EQ( ::upnp::UpnpContentDirectoryRequest::PROTOCOL_INFO, upnp_command.type);
    EXPECT_TRUE(false);
}

